src/ex_Tabakon/InformationRegisters/ТБК_РезультатФокуснойМотивации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТБК_РезультатФокуснойМотивации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПланПродаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФактПродаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСверх</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаФакт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПремии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаСверх</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Продавец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодМотивации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФокусГруппа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ex_Tabakon/Enums/ТБКТипыПродавцов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТБКТипыПродавцов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОсновнойПродавец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВторойПродавец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МладшийПродавец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НочнойПродавец</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ex_Tabakon/Documents/ТБК_ВедомостьОПродажахЗаДень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТБК_ВедомостьОПродажахЗаДень</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Магазины</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассыККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаЗаСменуПоКассе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыручкаЗаСменуПоКассе_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомостьПродажНеУчтено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомостьПродажНеУчтено_ПКО</Name>
					<Comment>:</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедомостьПродажнеНеУчтено_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаПоБанковскимКартам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаНаличными</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратОтПокупателяНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВозвратОтПокупателяБезНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходыОтдела</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходыОтдела_РКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходыОтдела_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗП_Продавца</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличныеКСдаче</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗП_Продаца_Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗП_Продавца_РКО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаКакуюДату</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РКО</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОтчетыОРозничныхПродажах</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОтчетОРозничныхПродажах</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаПоБанковскимКартам</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаНаличными</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратОтПокупателяНал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозвратОтПокупателяБезНал</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Возвраты</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыемкаДенежныхСредств</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выемка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ВыемкаДенежныхСредствИзКассыККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПКО</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Продавцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Продавец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПродавца</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТБКТипыПродавцов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяСмены</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПродавецНаЗамену</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Купюры5000</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Купюры2000</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/ex_Tabakon/CommonModules/ТБК_Миграции/Ext/Module.bsl
Процедура ОбновитьРезультатФокуснойМотивации() Экспорт 
	
	ДатаПересчета	=	ОбщегоНазначения.ПолучитьЗначениеТБККонстанты("ДанныеПоФокуснойМотивацииПересчитаны");
	
	Если ДатаПересчета <> Неопределено тогда
		Если НачалоДня(ДатаПересчета) = НачалоДня(ТекущаяДата()) тогда
			Возврат
		КонецЕсли;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	ПериодНачало = НачалоМесяца(ТекущаяДата());
	КонецПериода = КонецМесяца(ТекущаяДата());
	
	//ДатаПрошлогоМесяца = ДобавитьМесяц(ТекущаяДата(), -2);
	//ПериодНачало = НачалоМесяца(ДатаПрошлогоМесяца);
	//КонецПериода = КонецМесяца(ПериодНачало);
	
	Запрос.УстановитьПараметр("Период2", КонецПериода);
	Запрос.УстановитьПараметр("Период1", ПериодНачало);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ТБК_РезультатФокуснойМотивации.ПериодМотивации КАК ПериодМотивации
	|ИЗ
	|	РегистрСведений.ТБК_РезультатФокуснойМотивации КАК ТБК_РезультатФокуснойМотивации
	|ГДЕ
	|	ТБК_РезультатФокуснойМотивации.ПериодМотивации МЕЖДУ &Период1 И &Период2
	|
	|СГРУППИРОВАТЬ ПО
	|	ТБК_РезультатФокуснойМотивации.ПериодМотивации";
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Набор = РегистрыСведений.ТБК_РезультатФокуснойМотивации.СоздатьНаборЗаписей();
		Набор.Отбор.ПериодМотивации.Установить(Выборка.ПериодМотивации);
		Набор.Записать();
	КонецЦикла;
	
	
	// пересчитать и отправить в ут	
	Прокси = ОбщегоНазначенияВызовСервера.ПолучитьПроктиWStbk();
	
	ПериодКонец = НачалоДня(КонецПериода);
	
	Пока ПериодНачало <> ПериодКонец Цикл
		
		//ПОЛУЧАЕМ ПРОДАВЦОВ 	
		Запрос	= Новый запрос("ВЫБРАТЬ
		|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец КАК Продавец,
		|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Магазин КАК Магазин
		|ИЗ
		|	Документ.ТБК_ВедомостьОПродажахЗаДень.Продавцы КАК ТБК_ВедомостьОПродажахЗаДеньПродавцы
		|ГДЕ
		|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.ТипПродавца = &ТипПродавца
		|	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Проведен
		|
		|СГРУППИРОВАТЬ ПО
		|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Продавец,
		|	ТБК_ВедомостьОПродажахЗаДеньПродавцы.Ссылка.Магазин");  
		
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ПериодНачало));
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(ПериодНачало));
		Запрос.УстановитьПараметр("ТипПродавца", Перечисления.ТБКТипыПродавцов.ОсновнойПродавец);
		РезВсеПродавцы = Запрос.Выполнить().Выгрузить();    
		
		флОтправленоУспешно = Ложь; 
		
		МассивОбщий	= Новый Массив; 
		
		Для каждого СтрокаПродавец из РезВсеПродавцы Цикл
			
			ТаблицаРасшифровка	=	Обработки.РМКУправляемыйРежим.ПолучитьТаблицуПоФокуснойМотивации(0, ПериодНачало, 1, СтрокаПродавец.Продавец);
			
			ДанныеДляЗаписи	=	Новый Структура;
			ДанныеДляЗаписи.Вставить("Продавец", СтрокаПродавец.Продавец);	
			
			МассивДляЗаписи	=	Новый Массив;
			Для каждого СтрокаДанные из ТаблицаРасшифровка Цикл		
				ДляЗаписи	=	Новый Структура;
				ДляЗаписи.Вставить("ФокусГруппа",		СтрокаДанные.ФокусГруппа);
				ДляЗаписи.Вставить("ПланПродаж", 		СтрокаДанные.ПланПродаж);
				ДляЗаписи.Вставить("ФактПродаж", 		СтрокаДанные.ФактПродаж);
				ДляЗаписи.Вставить("КоличествоСверх", 	СтрокаДанные.КоличествоСверх);
				ДляЗаписи.Вставить("СуммаФакт", 		СтрокаДанные.СуммаФакт);
				ДляЗаписи.Вставить("СуммаСверх", 		СтрокаДанные.СуммаСверх);
				ДляЗаписи.Вставить("СуммаПремии", 		СтрокаДанные.СуммаПремии);
				
				МассивДляЗаписи.Добавить(ДляЗаписи);
			КонецЦикла;
			ДанныеДляЗаписи.Вставить("ДляЗаписи", МассивДляЗаписи);
			
			МассивОбщий.Добавить(ДанныеДляЗаписи);
			
		КонецЦикла;	
		
		
		Магазин = ОбщегоНазначения.ПолучитьМагазин();
		
		Для каждого ПродавецМагазин из МассивОбщий Цикл
			ДляЗаписи	=	ПродавецМагазин.ДляЗаписи;
			
			Для каждого СтрокаДанных из ДляЗаписи Цикл
				Рег = РегистрыСведений.ТБК_РезультатФокуснойМотивации.СоздатьМенеджерЗаписи();
				Рег.ПериодМотивации	=	ПериодНачало;
				рег.Магазин			=	Магазин;
				рег.Продавец		=	ПродавецМагазин.Продавец; 
				
				ЗаполнитьЗначенияСвойств(рег, СтрокаДанных);
				
				рег.Записать();
			КонецЦикла;  			
		КонецЦикла;
		
		// перенос
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("ДатаНач",НачалоДня(ПериодНачало));
		Запрос.УстановитьПараметр("ДатаКон",КонецДня(ПериодНачало));
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ТБК_РезультатФокуснойМотивации.Магазин КАК Магазин,
		|	ТБК_РезультатФокуснойМотивации.Продавец КАК Продавец,
		|	ТБК_РезультатФокуснойМотивации.ПериодМотивации КАК ПериодМотивации,
		|	ТБК_РезультатФокуснойМотивации.ФокусГруппа КАК ФокусГруппа,
		|	ТБК_РезультатФокуснойМотивации.ПланПродаж КАК ПланПродаж,
		|	ТБК_РезультатФокуснойМотивации.ФактПродаж КАК ФактПродаж,
		|	ТБК_РезультатФокуснойМотивации.КоличествоСверх КАК КоличествоСверх,
		|	ТБК_РезультатФокуснойМотивации.СуммаФакт КАК СуммаФакт,
		|	ТБК_РезультатФокуснойМотивации.СуммаПремии КАК СуммаПремии,
		|	ТБК_РезультатФокуснойМотивации.СуммаСверх КАК СуммаСверх
		|ИЗ
		|	РегистрСведений.ТБК_РезультатФокуснойМотивации КАК ТБК_РезультатФокуснойМотивации
		|ГДЕ
		|	ТБК_РезультатФокуснойМотивации.ПериодМотивации МЕЖДУ &ДатаНач И &ДатаКон
		|ИТОГИ ПО
		|	Продавец";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаПродавец = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		МассивВозврата	=	Новый Массив;
		
		Пока ВыборкаПродавец.Следующий() Цикл
			
			эл = Новый Структура;
			эл.Вставить("Продавец",		СокрЛП(Строка(ВыборкаПродавец.Продавец)));	
			эл.Вставить("Магазин",		СокрЛП(Строка(Магазин)));
			эл.Вставить("Период",		Строка(ПериодНачало));
			
			Выборка = ВыборкаПродавец.Выбрать();
			
			МассивДанные	=	Новый Массив;
			
			Пока Выборка.Следующий() Цикл
				
				Данные	=	Новый Структура;
				Данные.Вставить("ФокусГруппа",		Строка(Выборка.ФокусГруппа));
				Данные.Вставить("ПланПродаж", 		Строка(Выборка.ПланПродаж));
				Данные.Вставить("ФактПродаж", 		Строка(Выборка.ФактПродаж));
				Данные.Вставить("КоличествоСверх", 	Строка(Выборка.КоличествоСверх));
				Данные.Вставить("СуммаФакт", 		Строка(Выборка.СуммаФакт));
				Данные.Вставить("СуммаСверх", 		Строка(Выборка.СуммаСверх));
				Данные.Вставить("СуммаПремии", 		Строка(Выборка.СуммаПремии));
				
				МассивДанные.Добавить(Данные);
				
			КонецЦикла;
			эл.Вставить("Данные", МассивДанные);
			
			МассивВозврата.Добавить(эл);
			
		КонецЦикла;
		Ответ = Истина;
		JS = ОбщегоНазначения.СтруктураВjson_Общая(МассивВозврата);
		
		Ответ	=	Прокси.writeFocusMotivation_day(JS); 
		
		ПериодНачало = ПериодНачало + 60 * 60 * 24;
		
	КонецЦикла;
	
	Если Ответ Тогда
		ОбщегоНазначения.УстановитьЗначениеТБККонстанты("ДанныеПоФокуснойМотивацииПересчитаны", ТекущаяДата());				
	КонецЕсли;
	
КонецПроцедуры
